Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/optimizing-performance_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: optimizing-performance title: Optimizing Performance permalink: docs/optimizing-performance.html redirect_from:
ja: --- id: optimizing-performance title: パフォーマンス最適化 permalink: docs/optimizing-performance.html redirect_from:

source: Internally, React uses several clever techniques to minimize the number of costly DOM operations required to update the UI.
ja: React は UI の更新時に必要となる高コストな DOM 操作の回数を最小化するために、内部的にいくつかの賢いテクニックを使用しています。

source: For many applications, using React will lead to a fast user interface without doing much work to specifically optimize for performance. Nevertheless, there are several ways you can speed up your React application.
ja: 多くのアプリケーションでは React を使用するだけで、パフォーマンス向上のための特別な最適化を苦労して行わなくても、レスポンスの良いユーザインターフェースを実現できますが、それでもなお、React アプリケーションを高速化するための方法はいくつか存在します。

source: ## Use the Production Build {#use-the-production-build}
ja: ## 本番用ビルドを使用する {#use-the-production-build}

source: If you're benchmarking or experiencing performance problems in your React apps, make sure you're testing with the minified production build.
ja: React アプリケーションでベンチマークを行う場合やパフォーマンスの問題が発生している場合には、ミニファイされた本番用ビルドでテストしていることを確認してください。

source: By default, React includes many helpful warnings.
ja: デフォルトで React は多くの有用な警告チェックを行い、開発時にはとても有用です。

source: These warnings are very useful in development. However, they make React larger and slower so you should make sure to use the production version when you deploy the app.
ja: しかしそれによって React アプリケーションのサイズが肥大化し、速度が低下してしまうため、アプリケーションのデプロイ時には本番バージョンを使用していることを確認してください。

source: If you aren't sure whether your build process is set up correctly, you can check it by installing [React Developer Tools for Chrome](https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi).
ja: ビルドプロセスが正しく設定されているか分からない場合、[React Developer Tools for Chrome](https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi) をインストールして確認できます。

source: If you visit a site with React in production mode, the icon will have a dark background:
ja: 本番用モードの React のサイトを訪れた場合、アイコンは暗い背景となっています。

source: If you visit a site with React in development mode, the icon will have a red background:
ja: 開発モードの React のサイトを訪れた場合、アイコンは赤い背景となっています。

source: It is expected that you use the development mode when working on your app, and the production mode when deploying your app to the users.
ja: アプリケーションに対して作業をしているときは開発モードを使用し、利用者に配布する場合には本番用モードを使用することをお勧めします。

source: You can find instructions for building your app for production below.
ja: 本番用にアプリを構築するためのそれぞれのツールにおける手順を以下に示します。

source: If your project is built with [Create React App](https://github.com/facebookincubator/create-react-app), run:
ja: プロジェクトが [Create React App](https://github.com/facebookincubator/create-react-app) で構築されているなら、以下のコードを実行してください。

source: This will create a production build of your app in the `build/` folder of your project.
ja: これでアプリケーションの本番用ビルドがプロジェクト内の `build/` フォルダに作成されます。

source: Remember that this is only necessary before deploying to production.
ja: これが必要なのは本番用ビルドだけであることに留意してください。

source: For normal development, use `npm start`.
ja: 通常の開発作業では、`npm start` を使用してください。

source: ### Single-File Builds {#single-file-builds}
ja: ### 単一ファイル版ビルド {#single-file-builds}

source: We offer production-ready versions of React and React DOM as single files:
ja: React と ReactDOM をそれぞれ単一ファイル化した本番環境用のバージョンを提供しています。

source: Remember that only React files ending with `.production.min.js` are suitable for production.
ja: 本番用に適しているのは、React ファイル名の末尾が `.production.min.js` であるもののみであることに留意ください。

source: For the most efficient Brunch production build, install the [`terser-brunch`](https://github.com/brunch/terser-brunch) plugin:
ja: Brunch で最も効率のよい本番用ビルドを行うには、[`terser-brunch`](https://github.com/brunch/terser-brunch) をインストールしてください：

source: Then, to create a production build, add the `-p` flag to the `build` command:
ja: そして、本番用ビルドを作成するために、`build` コマンドに`-p` オプションを指定して実行します。

source: Remember that you only need to do this for production builds.
ja: これが必要なのは本番用ビルドだけであることに留意してください。

source: You shouldn't pass the `-p` flag or apply this plugin in development, because it will hide useful React warnings and make the builds much slower.
ja: React の有用な警告表示が隠されたり、ビルド速度が大幅に遅くなったりしますので、開発用では `-p` フラグを指定したり、`uglify-js-brunch` プラグインを適用したりしないでください。

source: For the most efficient Browserify production build, install a few plugins:
ja: Browserify で最も効率の良い本番用ビルドを行うには、いくつかのプラグインをインストールしてください。

source: To create a production build, make sure that you add these transforms **(the order matters)**:
ja: 本番用ビルドを作成するには、以下の変換 (transform) を追加してください（**順番は重要です**）。

source: * The [`envify`](https://github.com/hughsk/envify) transform ensures the right build environment is set.
ja: * [`envify`](https://github.com/hughsk/envify) 変換は正しいビルド用の環境変数が確実に設定されるようにします。

source: Make it global (`-g`).
ja: グローバルに設定してください (`-g`)。

source: * The [`uglifyify`](https://github.com/hughsk/uglifyify) transform removes development imports.
ja: * [`uglifyify`](https://github.com/hughsk/uglifyify) 変換は開発用にインポートしたライブラリを削除します。

source: Make it global too (`-g`).
ja: これもグローバルに設定してください (`-g`)。

source: * Finally, the resulting bundle is piped to [`terser`](https://github.com/terser-js/terser) for mangling ([read why](https://github.com/hughsk/uglifyify#motivationusage)).
ja: * 最後に結果として出力されたものを、名前の圧縮のために [`terser`](https://github.com/terser-js/terser) にパイプします（[理由を読む](https://github.com/hughsk/uglifyify#motivationusage)）。

source: For example:
ja: 以下に例を示します。

source: You shouldn't apply these plugins in development because they will hide useful React warnings, and make the builds much slower.
ja: React の有用な警告文が隠されたり、ビルド速度が大幅に遅くなったりしますので、開発用ではこれらのプラグインを適用しないでください。

source: For the most efficient Rollup production build, install a few plugins:
ja: Rollup で最も効率のよい本番用ビルドを行うには、いくつかのプラグインを以下のようにインストールします。

source: To create a production build, make sure that you add these plugins **(the order matters)**:
ja: 本番用ビルドを作成するには、以下のプラグインを追加してください（**順番は重要**です）。

source: * The [`replace`](https://github.com/rollup/rollup-plugin-replace) plugin ensures the right build environment is set.
ja: * [`replace`](https://github.com/rollup/rollup-plugin-replace) プラグインは正しいビルド用の環境変数が確実に設定されるようにします。

source: * The [`commonjs`](https://github.com/rollup/rollup-plugin-commonjs) plugin provides support for CommonJS in Rollup.
ja: * [`commonjs`](https://github.com/rollup/rollup-plugin-commonjs) プラグインは Rollup で CommonJS をサポートできるようにします。

source: * The [`terser`](https://github.com/TrySound/rollup-plugin-terser) plugin compresses and mangles the final bundle.
ja: * [`terser`](https://github.com/TrySound/rollup-plugin-terser) プラグインは出力された最終的なバンドルを圧縮し、mangle（訳注：変数名や識別子を短縮）します。

source: For a complete setup example [see this gist](https://gist.github.com/Rich-Harris/cb14f4bc0670c47d00d191565be36bf0).
ja: 設定例の全体はこの [gist を参照](https://gist.github.com/Rich-Harris/cb14f4bc0670c47d00d191565be36bf0)してください。

source: You shouldn't apply the `terser` plugin or the `replace` plugin with `'production'` value in development because they will hide useful React warnings, and make the builds much slower.
ja: React の有用な警告表示が隠されたり、ビルド速度が大幅に遅くなったりしますので、開発用では `terser` プラグインもしくは `replace` プラグインを `'production'` という値で適用しないでください。

source: >**Note:** > >If you're using Create React App, please follow [the instructions above](#create-react-app).<br> >This section is only relevant if you configure webpack directly.
ja: >**補足：** > > Create React App を利用している場合は、[Create React App についての前述の説明](#create-react-app)に従ってください。<br/> > このセクションは直接 webpack の設定を行いたい人向けです。

source: Webpack v4+ will minify your code by default in production mode.
ja: Webpack v4 以降では本番 (production) モードでコードの minify を自動で行います。

source: You can learn more about this in [webpack documentation](https://webpack.js.org/guides/production/).
ja: より詳細な説明については [webpack のドキュメント](https://webpack.js.org/guides/production/)を参照ください。

source: You shouldn't apply `TerserPlugin` in development because it will hide useful React warnings, and make the builds much slower.
ja: React の有用な警告文が隠されたり、ビルド速度が大幅に遅くなったりしますので、開発時には `TerserPlugin` を適用しないでください。

source: ## Profiling Components with the DevTools Profiler {#profiling-components-with-the-devtools-profiler}
ja: ## DevTools プロファイラを使用したコンポーネントのプロファイリング {#profiling-components-with-the-devtools-profiler}

source: `react-dom` 16.5+ and `react-native` 0.57+ provide enhanced profiling capabilities in DEV mode with the React DevTools Profiler.
ja: `react-dom` 16.5 以降と `react-native` 0.57 以降では、開発モードにおける強化されたプロファイリング機能を React DevTools プロファイラにて提供しています。

source: An overview of the Profiler can be found in the blog post ["Introducing the React Profiler"](/blog/2018/09/10/introducing-the-react-profiler.html).
ja: このプロファイラの概要はブログ記事 ["Introducing the React Profiler"](/blog/2018/09/10/introducing-the-react-profiler.html) で説明されています。

source: A video walkthrough of the profiler is also [available on YouTube](https://www.youtube.com/watch?v=nySib7ipZdk).
ja: チュートリアル動画も [YouTube で閲覧できます](https://www.youtube.com/watch?v=nySib7ipZdk)。

source: If you haven't yet installed the React DevTools, you can find them here:
ja: React DevTools をまだインストールしていない場合は、以下で見つけることができます。

source: - [Chrome Browser Extension](https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi?hl=en) - [Firefox Browser Extension](https://addons.mozilla.org/en-GB/firefox/addon/react-devtools/) - [Standalone Node Package](https://www.npmjs.com/package/react-devtools)
ja: - [Chrome ブラウザ拡張](https://chrome.google.com/webstore/detail/react-developer-tools/fmkadmapgofadopljbjfkapdkoienihi?hl=en) - [Firefox ブラウザ拡張](https://addons.mozilla.org/en-GB/firefox/addon/react-devtools/) - [スタンドアロンの Node パッケージ](https://www.npmjs.com/package/react-devtools)

source: > Note > > A production profiling bundle of `react-dom` is also available as `react-dom/profiling`.
ja: > 補足 > > 本番ビルド版 `react-dom` のプロファイリング可能なバンドルとして `react-dom/profiling` が利用可能です。

source: > Read more about how to use this bundle at [fb.me/react-profiling](https://fb.me/react-profiling)
ja: > このバンドルの使い方の詳細については、[fb.me/react-profiling](https://fb.me/react-profiling) を参照してください。

source: > Note > > Before React 17, we use the standard [User Timing API](https://developer.mozilla.org/en-US/docs/Web/API/User_Timing_API) to profile components with the chrome performance tab.
ja: > 捕捉 > > React 17 より前のバージョンでは、標準の [User Timing API](https://developer.mozilla.org/en-US/docs/Web/API/User_Timing_API) を用いて Chrome のパフォーマンスタブでコンポーネントのプロファイリングが行われていました。

source: > For a more detailed walkthrough, check out [this article by Ben Schwarz](https://calibreapp.com/blog/react-performance-profiling-optimization).
ja: > これについての概要は [Ben Schwarz によるこの記事](https://calibreapp.com/blog/react-performance-profiling-optimization)を参照してください。

source: ## Virtualize Long Lists {#virtualize-long-lists}
ja: ## 長いリストの仮想化 {#virtualize-long-lists}

source: If your application renders long lists of data (hundreds or thousands of rows), we recommend using a technique known as "windowing".
ja: アプリケーションが長いデータのリスト（数百〜数千行）をレンダーする場合は、「ウィンドウイング」として知られるテクニックを使うことをおすすめします。

source: This technique only renders a small subset of your rows at any given time, and can dramatically reduce the time it takes to re-render the components as well as the number of DOM nodes created.
ja: このテクニックでは、ある瞬間ごとにはリストの小さな部分集合のみを描画することで、生成する DOM ノードの数およびコンポーネントの再描画にかかる時間を大幅に削減することができます。

source: [react-window](https://react-window.now.sh/) and [react-virtualized](https://bvaughn.github.io/react-virtualized/) are popular windowing libraries.
ja: [react-window](https://react-window.now.sh/) と [react-virtualized](https://bvaughn.github.io/react-virtualized/) は人気があるウィンドウイング処理のライブラリです。

source: They provide several reusable components for displaying lists, grids, and tabular data.
ja: これらはリスト、グリッド、および表形式のデータを表示するための、いくつかの再利用可能コンポーネントを提供しています。

source: You can also create your own windowing component, like [Twitter did](https://medium.com/@paularmstrong/twitter-lite-and-high-performance-react-progressive-web-apps-at-scale-d28a00e780a3), if you want something more tailored to your application's specific use case.
ja: アプリケーションの特定のユースケースに合わせた追加的な処理をする場合は、[Twitter](https://medium.com/@paularmstrong/twitter-lite-and-high-performance-react-progressive-web-apps-at-scale-d28a00e780a3) が行なっているように、独自のウィンドウイング処理のコンポーネントを作成することもできます。

source: ## Avoid Reconciliation {#avoid-reconciliation}
ja: ## リコンシリエーション（差分検出処理）を避ける {#avoid-reconciliation}

source: React builds and maintains an internal representation of the rendered UI.
ja: React はレンダーされた UI の内部表現を構築し、維持します。

source: It includes the React elements you return from your components.
ja: その内部表現にはコンポーネントが返した React 要素も含まれています。

source: This representation lets React avoid creating DOM nodes and accessing existing ones beyond necessity, as that can be slower than operations on JavaScript objects.
ja: React はこの内部表現を使うことによって、DOM ノードの不要な作成やアクセス（これらは JavaScript オブジェクト操作よりも低速です）を回避します。

source: Sometimes it is referred to as a "virtual DOM", but it works the same way on React Native.
ja: この内部表現はしばしば "仮想 DOM" と呼ばれますが、React Native 上でも同様に動くものです。

source: When a component's props or state change, React decides whether an actual DOM update is necessary by comparing the newly returned element with the previously rendered one.
ja: コンポーネントの props や state が変更された場合、React は新しく返された要素と以前にレンダーされたものとを比較することで、実際の DOM の更新が必要かを判断します。

source: When they are not equal, React will update the DOM.
ja: それらが等しくない場合、React は DOM を更新します。

source: Even though React only updates the changed DOM nodes, re-rendering still takes some time.
ja: React は変更された DOM ノードだけを更新するとはいえ、再レンダーには時間がかかります。

source: In many cases it's not a problem, but if the slowdown is noticeable, you can speed all of this up by overriding the lifecycle function `shouldComponentUpdate`, which is triggered before the re-rendering process starts.
ja: 多少の時間がかかっても多くの場合は問題にはなりませんが、遅延が目立つ場合、再レンダープロセスが開始される前にトリガーされるライフサイクル関数 `shouldComponentUpdate` をオーバーライド定義することで、スピードを抜本的に向上できます。

source: The default implementation of this function returns `true`, leaving React to perform the update:
ja: この関数のデフォルトの実装は `true` を返し、React に更新処理をそのまま実行させます：

source: If you know that in some situations your component doesn't need to update, you can return `false` from `shouldComponentUpdate` instead, to skip the whole rendering process, including calling `render()` on this component and below.
ja: ある状況においてコンポーネントを更新する必要がないと分かっているなら、`shouldComponentUpdate` から `false` を返すことにより、該当コンポーネントおよび配下への `render()` 呼び出しを含む、レンダー処理の全体をスキップすることができます。

source: In most cases, instead of writing `shouldComponentUpdate()` by hand, you can inherit from [`React.PureComponent`](/docs/react-api.html#reactpurecomponent).
ja: ほとんどの場合には、手書きの `shouldComponentUpdate()` を定義する代わりに [`React.PureComponent`](/docs/react-api.html#reactpurecomponent) を継承できます。

source: It is equivalent to implementing `shouldComponentUpdate()` with a shallow comparison of current and previous props and state.
ja: これは現在と直前の props と state に対する浅い (shallow) 比較を行う `shouldComponentUpdate()` を実装することと同じです。

source: ## shouldComponentUpdate In Action {#shouldcomponentupdate-in-action}
ja: ## shouldComponentUpdate の実際の動作 {#shouldcomponentupdate-in-action}

source: Here's a subtree of components.
ja: 以下のようなコンポーネントのサブツリーがあるとします。

source: For each one, `SCU` indicates what `shouldComponentUpdate` returned, and `vDOMEq` indicates whether the rendered React elements were equivalent.
ja: それぞれ、`SCU` は `shouldComponentUpdate` が返した値（訳注：緑は true、赤は false）を示し、`vDOMEq` はレンダーされた React 要素が等しかったかどうか（訳注：緑は等しい、赤は等しくない）を示します。

source: Finally, the circle's color indicates whether the component had to be reconciled or not.
ja: 最後に、円の色はコンポーネントに対してツリーの差分を検出するリコンシリエーション処理を必要としたのかどうか（訳注：緑は不要、赤は必要）を示します。

source: Since `shouldComponentUpdate` returned `false` for the subtree rooted at C2, React did not attempt to render C2, and thus didn't even have to invoke `shouldComponentUpdate` on C4 and C5.
ja: C2 をルートとするサブツリーでは `shouldComponentUpdate` が `false` を返したので、React は C2 をレンダーしようとしませんでした。したがって C4 と C5 については `shouldComponentUpdate` を実行する必要すらなかったわけです。

source: For C1 and C3, `shouldComponentUpdate` returned `true`, so React had to go down to the leaves and check them.
ja: C1 と C3 では、`shouldComponentUpdate` が `true` を返したので、React は葉ノードにも移動してチェックする必要がありました。

source: For C6 `shouldComponentUpdate` returned `true`, and since the rendered elements weren't equivalent React had to update the DOM.
ja: C6 では `shouldComponentUpdate` が `true` を返し、そしてレンダーされた React 要素も等しくなかったので、React は DOM を更新する必要がありました。

source: The last interesting case is C8.
ja: 最後の興味深いケースが C8 です。

source: React had to render this component, but since the React elements it returned were equal to the previously rendered ones, it didn't have to update the DOM.
ja: React はこのコンポーネントをレンダーする必要がありましたが、返された React 要素は前回レンダーされたときものと同じだったので、DOM の更新は必要ありませんでした。

source: Note that React only had to do DOM mutations for C6, which was inevitable.
ja: React が実 DOM を更新しなければならなかったのは、C6 だけだったことに注目してください。C6 の更新は避けられないものでした。

source: For C8, it bailed out by comparing the rendered React elements, and for C2's subtree and C7, it didn't even have to compare the elements as we bailed out on `shouldComponentUpdate`, and `render` was not called.
ja: C8 では、レンダーされた React 要素の比較のおかげで実 DOM を修正せずに済みました。C2 のサブツリーと C7 のケースでは `shouldComponentUpdate` のおかげで、`render` メソッドの呼び出しや React 要素の比較処理すらスキップすることができました。

source: ## Examples {#examples}
ja: ## 例 {#examples}

source: If the only way your component ever changes is when the `props.color` or the `state.count` variable changes, you could have `shouldComponentUpdate` check that:
ja: コンポーネントが変化するのが `props.color` または `state.count` 変数が変化した時だけだとしたら、`shouldComponentUpdate` では以下のようなチェックを行えます。

source: In this code, `shouldComponentUpdate` is just checking if there is any change in `props.color` or `state.count`.
ja: このコードは、`shouldComponentUpdate` は `props.color` または `state.count` の変化の有無を単にチェックしているだけです。

source: If those values don't change, the component doesn't update.
ja: これらの値が変化していなければコンポーネントは更新されません。

source: If your component got more complex, you could use a similar pattern of doing a "shallow comparison" between all the fields of `props` and `state` to determine if the component should update.
ja: コンポーネントがもっと複雑な場合は、`props` と `state` のすべてのフィールドに対して「浅い比較」をするという同種のパターンでコンポーネント更新の必要性を決定できます。

source: This pattern is common enough that React provides a helper to use this logic - just inherit from `React.PureComponent`.
ja: このパターンはとても一般的なので、React はこのロジックのためのヘルパーを用意しており、`React.PureComponent` から継承するだけで使用できます。

source: So this code is a simpler way to achieve the same thing:
ja: なので以下のコードで前述のコードと同じことをよりシンプルに実装できます。

source: Most of the time, you can use `React.PureComponent` instead of writing your own `shouldComponentUpdate`.
ja: ほとんどの場合、自分で `shouldComponentUpdate` を記述する代わりに `React.PureComponent` を使うことができます。

source: It only does a shallow comparison, so you can't use it if the props or state may have been mutated in a way that a shallow comparison would miss.
ja: もっとも、浅い比較を行うだけですので、浅い比較では検出できない形で props や state がミューテート（mutate; 書き換え）されている可能性がある場合には使えません。

source: This can be a problem with more complex data structures.
ja: この事はより複雑なデータ構造の場合には問題となります。

source: For example, let's say you want a `ListOfWords` component to render a comma-separated list of words, with a parent `WordAdder` component that lets you click a button to add a word to the list.
ja: 例えば、カンマ区切りで単語をレンダーする `ListOfWords` コンポーネントと、ボタンをクリックしてリストに単語を追加できる親コンポーネント `WordAdder` が必要だとして、以下のコードは正しく動作しません。

source: This code does *not* work correctly: ```javascript class ListOfWords extends React.PureComponent {
ja: ```javascript class ListOfWords extends React.PureComponent {

source: The problem is that `PureComponent` will do a simple comparison between the old and new values of `this.props.words`.
ja: 問題は `PureComponent` が `this.props.words` の古い値と新しい値を単純に比較していることにあります。

source: Since this code mutates the `words` array in the `handleClick` method of `WordAdder`, the old and new values of `this.props.words` will compare as equal, even though the actual words in the array have changed.
ja: 上記のコードでは `WordAdder` の handleClick メソッド内で `words` 配列の内容をミューテートしてしまうので、`this.props.words` の新旧の値は、たとえ配列内の実際の単語が変更されていたとしても、比較の結果同じだとみなしてしまうのです。

source: The `ListOfWords` will thus not update even though it has new words that should be rendered.
ja: そのため `ListOfWords` はレンダーすべき新しい単語が追加されているにも関わらず、更新されません。

source: ## The Power Of Not Mutating Data {#the-power-of-not-mutating-data}
ja: ## データを変更しないことの効果 {#the-power-of-not-mutating-data}

source: The simplest way to avoid this problem is to avoid mutating values that you are using as props or state.
ja: この問題を避ける最も単純な方法は、props や state として使用する値のミューテートを避けることです。

source: For example, the `handleClick` method above could be rewritten using `concat` as:
ja: 例えば、上記の `handleClick` メソッドは `concat` を使って以下のように書き換えることができます：

source: ES6 supports a [spread syntax](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator) for arrays which can make this easier.
ja: ES6 はこれをより簡潔に実装できる配列の[スプレッド構文](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_operator)をサポートしています。

source: If you're using Create React App, this syntax is available by default.
ja: Create React App を使用していれば、この構文はデフォルトで利用できます。

source: You can also rewrite code that mutates objects to avoid mutation, in a similar way.
ja: 同様に、オブジェクトについてもミューテートするコードをしないように書き換えることができます。

source: For example, let's say we have an object named `colormap` and we want to write a function that changes `colormap.right` to be `'blue'`.
ja: 例えば、`colormap` というオブジェクトがあり、`colormap.right` を `'blue'` に更新する関数が必要だとしましょう。

source: We could write:
ja: 以下のように書くことも可能ですが、

source: To write this without mutating the original object, we can use [Object.assign](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/assign) method:
ja: この処理を、元オブジェクトをミューテートせずに実装するために、[Object.assign](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Global_Objects/Object/assign) を使用できます。

source: `updateColorMap` now returns a new object, rather than mutating the old one.
ja: これで、`updateColorMap` は古いオブジェクトをミューテートするのではなく新しいオブジェクトを返すようになります。

source: `Object.assign` is in ES6 and requires a polyfill.
ja: `Object.assign` は ES6 からの機能であり、ポリフィルが必要です（訳注：ブラウザや処理系が ES6 に未対応の場合）。

source: [Object spread syntax](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax) makes it easier to update objects without mutation as well:
ja: 同様に、[オブジェクトのスプレッドプロパティ構文](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Spread_syntax)を使うことで、ミューテートを避けてのオブジェクト更新が容易になります。

source: This feature was added to JavaScript in ES2018.
ja: この機能は ES2018 で JavaScript に追加されたものです。

source: If you're using Create React App, both `Object.assign` and the object spread syntax are available by default.
ja: Create React App を使用しているなら、`Object.assign` およびオブジェクトのスプレッド構文の両方がデフォルトで利用できます。

source: When you deal with deeply nested objects, updating them in an immutable way can feel convoluted.
ja: 深くネストされたオブジェクトを扱っている場合、ミューテートを行わない形式で更新することが複雑に感じることがあります。

source: If you run into this problem, check out [Immer](https://github.com/mweststrate/immer) or [immutability-helper](https://github.com/kolodny/immutability-helper).
ja: このような問題がある場合は [Immer](https://github.com/mweststrate/immer) や [immutability-helper](https://github.com/kolodny/immutability-helper) を試してみてください。

source: These libraries let you write highly readable code without losing the benefits of immutability.
ja: これらのライブラリはミューテートを行わないことによる利点を損なわずに、読みやすいコードを書くのに役立ちます。
